Revit 2026 API

# CorrectionFactorGetTemperature Method

---

Get temperature which is used for specifying correction factor. The value returned is quantified in the document's selected unit of electrical temperature.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double GetTemperature()
```
```vb
Public Function GetTemperature As Double
```
```cpp
public:
double GetTemperature()
```
```fsharp
member GetTemperature : unit -> float
```

#### Return Value

Double

#### Reference

CorrectionFactor Class

Autodesk.Revit.DB.Electrical Namespace